loadtest.yml
config:
  target: "ws://localhost:4000"
  phases:
    - duration: 60  # Test for 60 seconds
      arrivalRate: 10 # Every second, add 10 users
      rampTo: 100 # And ramp it up to 100 users in total over the 60s period
      name: "Ramping up the load"
    - duration: 120 # Then resume the load test for 120s
      arrivalRate: 100 # With those 100 users we ramped up to in the first phase
      rampTo: 200 # And keep it steady at 100 users
      name: "Pushing a constant load"
  ws:
    headers:
      X-Forwarded-For: "{{$randomNumber(1,254)}}.{{$randomNumber(1,254)}}.{{$randomNumber(1,254)}}.{{$randomNumber(1,254)}}"
scenarios:
  - engine: "ws"
    flow:
      - send: '{"command":"server_info"}'  # Subscribe to the public channel
      - think: 2 # Every connection will remain open for 15s
      - send: '{"command":"subscribe","streams":["ledger"]}'  # Subscribe to the public channel
      - think: 100 # Every connection will remain open for 15s